app/controllers/games_controller.rb

    def index
        @games = Game.all.order(id: :asc)
---
SELECT "games".* FROM "games" ORDER BY "games"."id" ASC

    def create
        @game = Game.new(game_params)
        if @game.save
---
INSERT INTO "games" ("created_at") VALUES ($1) RETURNING "id"  [["created_at", "2020-01-05 02:26:40.087899"]]

      def update
        @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]