app/controllers/pages_controller.rb

    def index
        @games = Game.order(created_at: :desc).limit(10)
---
SELECT "games".* FROM "games" ORDER BY "games"."created_at" DESC LIMIT $1  [["LIMIT", 10]]