app/controllers/searches_controller.rb

SELECT "games".* FROM "games" WHERE (body ILIKE '%ci%') ORDER BY "games"."created_at" DESC
---
  def index
      @query = params[:q]
      @games = Game.where("body ILIKE ?", "%#{@query}%").order(created_at: :desc)